# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [6]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/08%20-%20Day%20-%208%20-%20Python%20Quiz%20Session/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [7]:
baby_names=pd.read_csv('https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/08%20-%20Day%20-%208%20-%20Python%20Quiz%20Session/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [8]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [9]:
del baby_names['Unnamed: 0']

In [10]:
baby_names.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

In [25]:
del baby_names['Id']

In [11]:
baby_names.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [12]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [13]:
del baby_names['Year']

In [22]:
names = baby_names.groupby('Name').sum()
names.sort_values("Count",ascending=False)

                    Id   Count
Name
Jacob       1665681356  242874
Emma        1629482250  214852
Michael     1687521295  214405
Ethan       1660808475  209277
Isabella    1630131786  204798
...                ...     ...
Eniola         4930126       5
Atlantis       4904427       5
Marci          4901273       5
Simarpreet      553386       5
Nita            536782       5

[17632 rows x 2 columns]

### Step 8. How many different names exist in the dataset?

In [23]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [28]:
names[names.Count == names.Count.max()]

               Id   Count
Name
Jacob  1665681356  242874

In [31]:
names['Count'].idxmax()

'Jacob'

# Step 10. How many different names have the least occurrences?

In [33]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [39]:
names[names.Count == names.Count.median()]

               Id  Count
Name
Aishani   7810526     49
Alara    18841027     49
Alysse   22629405     49
Ameir    21780411     49
Anely     4349541     49
...           ...    ...
Sriram    9208203     49
Trinton  32822302     49
Vita     10241632     49
Yoni      6439154     49
Zuleima   3521373     49

[66 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [41]:
names['Count'].std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [42]:
names.describe()

                 Id          Count
count  1.763200e+04   17632.000000
mean   1.631922e+08    2008.932169
std    3.504513e+08   11006.069468
min    8.606500e+04       5.000000
25%    4.918375e+06      11.000000
50%    1.963463e+07      49.000000
75%    1.071826e+08     337.000000
max    3.223036e+09  242874.000000

##Step 14. What is the name with second most occurrences?

In [ ]:
nlargest() / nsmallest()

In [67]:
names[names.Count == names.Count.nlargest(2).iloc[-1]]

              Id   Count
Name
Emma  1629482250  214852

In [76]:
names[names.Count==names.Count.nsmallest(2).iloc[-1]]

               Id  Count
Name
Aadarsh   1728031      5
Aadin     5061280      5
Aaima     3746780      5
Aalaya     564907      5
Aaminah    523795      5
...           ...    ...
Zyien     5064200      5
Zyire     3853842      5
Zykeriah    89702      5
Zykierra  1238450      5
Zymari    3179888      5

[2578 rows x 2 columns]